bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_bt.h
/**
  ******************************************************************************
  * @file    fm33a0xxev_bt.h
  * @author  FM33A0XXEV Application Team
  * @version V1.0.0
  * @date    16-April-2020
  * @brief   This file contains all the functions prototypes for the BT firmware library.  
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __FM33A0XXEV_BT_H
#define __FM33A0XXEV_BT_H


#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "FM33A0XXEV.h" 
   
#define	BTx_CR1_CHEN_Pos	7	/* 高8位计数器（BT1H或BT2H）启动控制  */
#define	BTx_CR1_CHEN_Msk	(0x1U << BTx_CR1_CHEN_Pos)

#define	BTx_CR1_CLEN_Pos	6	/* 低8位计数器（BT1L或BT2L）启动控制
(Counter-Lowend enable)
1：启动低8bit计数器，在计数器模式下启动时将预置数值和加载值分别加载至计数器和比较寄存器；捕捉模式下启动时计数器由零开始自由计数，计数到0xFFFF后产生溢出信号然后由零开始重新计数，捕捉功能只工作在16位模式；在16位的定时/计数和捕捉模式下CHEN作为计数器的启动控制，CLEN自动失效
0：停止低8bit计数器计数 */
#define	BTx_CR1_CLEN_Msk	(0x1U << BTx_CR1_CLEN_Pos)
	/* 启动低8bit计数器，在计数器模式下启动时将预置数值和加载值分别加载至计数器和比较寄存器；捕捉模式下启动时计数器由零开始自由计数，计数到0xFFFF后产生溢出信号然后由零开始重新计数，捕捉功能只工作在16位模式；在16位的定时/计数和捕捉模式下CHEN作为计数器的启动控制，CLEN自动失效 */
	/* 停止低8bit计数器计数 */

#define	BTx_CR1_MODE_Pos	5	/* 工作模式选择 (work mode)
1：16位捕捉模式
0：8位定时/计数模式，若高位计数器计数源选择为低位计数器的溢出信号，则可实现16位定时/计数模式 */
#define	BTx_CR1_MODE_Msk	(0x1U << BTx_CR1_MODE_Pos)
#define	BTx_CR1_MODE_CAPTURE	(0x1U << BTx_CR1_MODE_Pos)	/* 16位捕捉模式 */
#define	BTx_CR1_MODE_COUNTER	(0x0U << BTx_CR1_MODE_Pos)	/* 8位定时/计数模式，若高位计数器计数源选择为低位计数器的溢出信号，则可实现16位定时/计数模式 */

#define	BTx_CR1_EDGESEL_Pos	4	/* 计数模式下的计数沿和周期捕捉时的捕捉沿选择位 (edge select)
1：计数模式采样计数源下降沿，周期捕捉模式时下沿捕捉
0：计数模式采样计数源上升沿，周期捕捉模式时上沿捕捉
注：不支持系统时钟的下降沿计数，捕捉源和计数源为系统时钟时选择下降沿将不会有效计数。 */
#define	BTx_CR1_EDGESEL_Msk	(0x1U << BTx_CR1_EDGESEL_Pos)
#define	BTx_CR1_EDGESEL_FALLING	(0x1U << BTx_CR1_EDGESEL_Pos)	/* 计数模式采样计数源下降沿，周期捕捉模式时下沿捕捉 */
#define	BTx_CR1_EDGESEL_RISING	(0x0U << BTx_CR1_EDGESEL_Pos)	/* 计数模式采样计数源上升沿，周期捕捉模式时上沿捕捉 */

#define	BTx_CR1_CAPMOD_Pos	3	/* 捕捉模式控制（只在捕捉模式下有效）(capture mode)
1：脉冲宽度捕捉
0：脉冲周期捕捉 */
#define	BTx_CR1_CAPMOD_Msk	(0x1U << BTx_CR1_CAPMOD_Pos)
#define	BTx_CR1_CAPMOD_PULSE	(0x1U << BTx_CR1_CAPMOD_Pos)	/* 脉冲宽度捕捉 */
#define	BTx_CR1_CAPMOD_CYCLE	(0x0U << BTx_CR1_CAPMOD_Pos)	/* 脉冲周期捕捉 */

#define	BTx_CR1_CAPCLR_Pos	2	/* 带清零捕捉模式控制 (capture clear)
1：不论在脉冲宽度还是周期捕捉情况下，捕捉到第一个沿后将计数器清零产生中断，捕捉到第二个沿后锁存（锁存到高低位预置数寄存器）计数值并同时清零计数器
0：捕捉不清零，计数器一直自由计数 */
#define	BTx_CR1_CAPCLR_Msk	(0x1U << BTx_CR1_CAPCLR_Pos)
	/* 不论在脉冲宽度还是周期捕捉情况下，捕捉到第一个沿后将计数器清零产生中断，捕捉到第二个沿后锁存（锁存到高低位预置数寄存器）计数值并同时清零计数器 */
	/* 捕捉不清零，计数器一直自由计数 */

#define	BTx_CR1_CAPONCE_Pos	1	/* 单次捕捉控制 (capture once)
1：单次捕捉有效，在捕捉到一次脉冲宽度或脉冲周期后计数器停止，若需要再次捕捉需重新启动
0：连续捕捉 */
#define	BTx_CR1_CAPONCE_Msk	(0x1U << BTx_CR1_CAPONCE_Pos)
#define	BTx_CR1_CAPONCE_SINGLE	(0x1U << BTx_CR1_CAPONCE_Pos)	/* 单次捕捉有效，在捕捉到一次脉冲宽度或脉冲周期后计数器停止，若需要再次捕捉需重新启动 */
#define	BTx_CR1_CAPONCE_CONTINUE	(0x0U << BTx_CR1_CAPONCE_Pos)	/* 连续捕捉 */

#define	BTx_CR1_PWM_Pos	0	/* PWM模式输出 (pulse width modulation)
1：PWM输出使能
0：PWM 输出不使能 */
#define	BTx_CR1_PWM_Msk	(0x1U << BTx_CR1_PWM_Pos)
	/* PWM输出使能 */
	/* PWM 输出不使能 */

#define	BTx_CR2_SIG2SEL_Pos	7	/* 计数器内部计数源信号选择 (signal group2 select)
1：内部计数源信号选择Group2
0：内部计数源信号选择Group1 */
#define	BTx_CR2_SIG2SEL_Msk	(0x1U << BTx_CR2_SIG2SEL_Pos)
#define	BTx_CR2_SIG2SEL_GROUP2	(0x1U << BTx_CR2_SIG2SEL_Pos)	/* 内部计数源信号选择Group2 */
#define	BTx_CR2_SIG2SEL_GROUP1	(0x0U << BTx_CR2_SIG2SEL_Pos)	/* 内部计数源信号选择Group1 */

#define	BTx_CR2_SIG1SEL_Pos	6	/* 计数器内部捕捉源信号选择 (signal group1 select)
1：内部捕捉源信号选择Group1
0：内部捕捉源信号选择Group2 */
#define	BTx_CR2_SIG1SEL_Msk	(0x1U << BTx_CR2_SIG1SEL_Pos)
#define	BTx_CR2_SIG1SEL_GROUP1	(0x1U << BTx_CR2_SIG1SEL_Pos)	/* 内部捕捉源信号选择Group1 */
#define	BTx_CR2_SIG1SEL_GROUP2	(0x0U << BTx_CR2_SIG1SEL_Pos)	/* 内部捕捉源信号选择Group2 */

#define	BTx_CR2_CNTHSEL_Pos	4	/* 高8位计数器计数源选择 (Counter Highend source select)
00/11：选择ET1的低位计数器的溢出信号，与低位计数器组成16位计数器
01：选择内部捕捉源信号
10：选择内部计数源信号或外部DIR输入组合信号 */
#define	BTx_CR2_CNTHSEL_Msk	(0x3U << BTx_CR2_CNTHSEL_Pos)
#define	BTx_CR2_CNTHSEL_COUNTER	(0x0U << BTx_CR2_CNTHSEL_Pos)	/* 选择ET1的低位计数器的溢出信号，与低位计数器组成16位计数器 */
#define	BTx_CR2_CNTHSEL_CAPTURE	(0x1U << BTx_CR2_CNTHSEL_Pos)	/* 选择内部捕捉源信号 */
#define	BTx_CR2_CNTHSEL_INNER	(0x2U << BTx_CR2_CNTHSEL_Pos)	/* 选择内部计数源信号或外部DIR输入组合信号 */

#define	BTx_CR2_DIREN_Pos	3	/* 外部输入DIR控制使能。通常电量脉冲输出时同时会输出一个由高低电平指示正反向的方向信号DIR。电路将通过DIR信号电平的高低，分别控制高位计数器和低位计数器计数使能，以实现针对正向、反向脉冲的各种计数功能 (direction bit enable)
1：外部输入的DIR信号有效，此时高低位计数器是否计数可由外部输入的DIR信号控制。
0：外部输入的DIR信号无效，此时高低位计数器是否计数将由内部控制信号控制。 */
#define	BTx_CR2_DIREN_Msk	(0x1U << BTx_CR2_DIREN_Pos)
	/* 外部输入的DIR信号有效，此时高低位计数器是否计数可由外部输入的DIR信号控制。 */
	/* 外部输入的DIR信号无效，此时高低位计数器是否计数将由内部控制信号控制。 */

#define	BTx_CR2_STDIR_Pos	2	/* 内部DIR控制信号，当DIREN为0，即外部输入DIR控制无效时，可由该信号代替DIR输入，直接控制内部计数器的计数。当需要外部DIR输入，即DIREN为1时，该位应设置为0 (set direction)
1：内部DIR信号为高电平，则高8位计数器计数 */
#define	BTx_CR2_STDIR_Msk	(0x1U << BTx_CR2_STDIR_Pos)
	/* 内部DIR信号为高电平，则高8位计数器计数 */

#define	BTx_CR2_SRCSEL_Pos	1	/* 低位计数器计数使能控制选择信号 (source select)
1低位计数器计数使能端选则常使能。此时低位计数器计数不受DIR控制，可将正反向所有脉冲一并计数
0：低位计数器计数使能端选则由寄存器STDIR或外部EX_SIG2输入控制。 */
#define	BTx_CR2_SRCSEL_Msk	(0x1U << BTx_CR2_SRCSEL_Pos)
	/* 低位计数器计数使能端选则由寄存器STDIR或外部EX_SIG2输入控制。 */

#define	BTx_CR2_DIRPO_Pos	0	/* 输入信号2极性选择 (direction polarity)
1：对外部输入DIR信号EX_SIG2反向
0：对外部输入DIR信号EX_SIG2不反向 */
#define	BTx_CR2_DIRPO_Msk	(0x1U << BTx_CR2_DIRPO_Pos)
#define	BTx_CR2_DIRPO_REVERSE	(0x1U << BTx_CR2_DIRPO_Pos)	/* 对外部输入DIR信号EX_SIG2反向 */
#define	BTx_CR2_DIRPO_NON	(0x0U << BTx_CR2_DIRPO_Pos)	/* 对外部输入DIR信号EX_SIG2不反向 */

#define	BTx_CFGR1_RTCSEL2_Pos	6	/* RTCOUT2信号选择控制2 (RTCOUT2 source select)
00 = 32768Hz，XTLF时钟输出
01 = RTCSec，由RTC模块输出的秒信号
10 = RTCMin，由RTC模块输出的分钟信号
11 = RFU */
#define	BTx_CFGR1_RTCSEL2_Msk	(0x3U << BTx_CFGR1_RTCSEL2_Pos)
#define	BTx_CFGR1_RTCSEL2_32768HZ	(0x0U << BTx_CFGR1_RTCSEL2_Pos)
#define	BTx_CFGR1_RTCSEL2_RTC_SEC	(0x1U << BTx_CFGR1_RTCSEL2_Pos)
#define	BTx_CFGR1_RTCSEL2_RTC_MIN	(0x2U << BTx_CFGR1_RTCSEL2_Pos)

#define	BTx_CFGR1_RTCSEL1_Pos	4	/* RTCOUT1信号选择控制1 (RTCOUT1 source select)
00 = 32768Hz，XTLF时钟输出
01 = RTCSec，由RTC模块输出的秒信号
10 = RTCMin，由RTC模块输出的分钟信号
11 = RFU */
#define	BTx_CFGR1_RTCSEL1_Msk	(0x3U << BTx_CFGR1_RTCSEL1_Pos)
#define	BTx_CFGR1_RTCSEL1_32768HZ	(0x0U << BTx_CFGR1_RTCSEL1_Pos)
#define	BTx_CFGR1_RTCSEL1_RTC_SEC	(0x1U << BTx_CFGR1_RTCSEL1_Pos)
#define	BTx_CFGR1_RTCSEL1_RTC_MIN	(0x2U << BTx_CFGR1_RTCSEL1_Pos)

#define	BTx_CFGR1_GRP2SEL_Pos	2	/* Group2信号选择控制 (Group2 source select)
00 = APBCLK
01 = RTCOUT2
10 = IN_SIG2，内部输入信号2
11 = EX_SIG2，外部输入信号2
注：不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 */
#define	BTx_CFGR1_GRP2SEL_Msk	(0x3U << BTx_CFGR1_GRP2SEL_Pos)
#define	BTx_CFGR1_GRP2SEL_APBCLK	(0x0U << BTx_CFGR1_GRP2SEL_Pos)	/* 不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 */
#define	BTx_CFGR1_GRP2SEL_RTCOUT2	(0x1U << BTx_CFGR1_GRP2SEL_Pos)
#define	BTx_CFGR1_GRP2SEL_IN_SIG2	(0x2U << BTx_CFGR1_GRP2SEL_Pos)
#define	BTx_CFGR1_GRP2SEL_EX_SIG2	(0x3U << BTx_CFGR1_GRP2SEL_Pos)

#define	BTx_CFGR1_GRP1SEL_Pos	0	/* Group1信号选择控制（可作为捕捉模式下采样时钟选择，同时可作为信号捕捉源）(Group1 source select)
00 = APBCLK
01 = RTCOUT1
10 = IN_SIG1，内部输入信号1
11 = EX_SIG1，外部输入信号1
注：不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 */
#define	BTx_CFGR1_GRP1SEL_Msk	(0x3U << BTx_CFGR1_GRP1SEL_Pos)
#define	BTx_CFGR1_GRP1SEL_APBCLK	(0x0U << BTx_CFGR1_GRP1SEL_Pos)	/* 不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 */
#define	BTx_CFGR1_GRP1SEL_RTCOUT1	(0x1U << BTx_CFGR1_GRP1SEL_Pos)
#define	BTx_CFGR1_GRP1SEL_IN_SIG1	(0x2U << BTx_CFGR1_GRP1SEL_Pos)
#define	BTx_CFGR1_GRP1SEL_EX_SIG1	(0x3U << BTx_CFGR1_GRP1SEL_Pos)

#define	BTx_CFGR2_EXSEL2_Pos	6	/* 外部输入信号选择控制2 (external source select2)
00 = BT1_IN0/BT2_IN0
01 = BT1_IN1/BT2_IN1
10 = BT1_IN2/BT2_IN2
11 = BT1_IN3/BT2_IN3 */
#define	BTx_CFGR2_EXSEL2_Msk	(0x3U << BTx_CFGR2_EXSEL2_Pos)
#define	BTx_CFGR2_EXSEL2_IN0	(0x0U << BTx_CFGR2_EXSEL2_Pos)
#define	BTx_CFGR2_EXSEL2_IN1	(0x1U << BTx_CFGR2_EXSEL2_Pos)
#define	BTx_CFGR2_EXSEL2_IN2	(0x2U << BTx_CFGR2_EXSEL2_Pos)
#define	BTx_CFGR2_EXSEL2_IN3	(0x3U << BTx_CFGR2_EXSEL2_Pos)

#define	BTx_CFGR2_EXSEL1_Pos	4	/* 外部输入信号选择控制1 (external source select1)
00 = BT1_IN0/BT2_IN0
01 = BT1_IN1/BT2_IN1
10 = BT1_IN2/BT2_IN2
11 = BT1_IN3/BT2_IN3 */
#define	BTx_CFGR2_EXSEL1_Msk	(0x3U << BTx_CFGR2_EXSEL1_Pos)
#define	BTx_CFGR2_EXSEL1_IN0	(0x0U << BTx_CFGR2_EXSEL1_Pos)
#define	BTx_CFGR2_EXSEL1_IN1	(0x1U << BTx_CFGR2_EXSEL1_Pos)
#define	BTx_CFGR2_EXSEL1_IN2	(0x2U << BTx_CFGR2_EXSEL1_Pos)
#define	BTx_CFGR2_EXSEL1_IN3	(0x3U << BTx_CFGR2_EXSEL1_Pos)

#define	BTx_CFGR2_INSEL2_Pos	2	/* 内部输入信号选择控制2 (internal source select 2)
00 = UART_RX3/UART_RX3
01 = UART_RX4/UART_RX4
10 = UART_RX5/UART_RX5
11 = RCLP/BT1_OUT */
#define	BTx_CFGR2_INSEL2_Msk	(0x3U << BTx_CFGR2_INSEL2_Pos)
#define	BTx_CFGR2_INSEL2_RX3	(0x0U << BTx_CFGR2_INSEL2_Pos)
#define	BTx_CFGR2_INSEL2_RX4	(0x1U << BTx_CFGR2_INSEL2_Pos)
#define	BTx_CFGR2_INSEL2_RX5	(0x2U << BTx_CFGR2_INSEL2_Pos)
#define	BTx_CFGR2_INSEL2_RCLP	(0x3U << BTx_CFGR2_INSEL2_Pos)

#define	BTx_CFGR2_INSEL1_Pos	0	/* 内部输入信号选择控制1 (internal source select 1)
00 = UART_RX0/UART_RX0
01 = UART_RX1/UART_RX1
10 = UART_RX2/UART_RX2
11 = RCLP/RCLP */
#define	BTx_CFGR2_INSEL1_Msk	(0x3U << BTx_CFGR2_INSEL1_Pos)
#define	BTx_CFGR2_INSEL1_RX0	(0x0U << BTx_CFGR2_INSEL1_Pos)
#define	BTx_CFGR2_INSEL1_RX1	(0x1U << BTx_CFGR2_INSEL1_Pos)
#define	BTx_CFGR2_INSEL1_RX2	(0x2U << BTx_CFGR2_INSEL1_Pos)
#define	BTx_CFGR2_INSEL1_RCLP	(0x3U << BTx_CFGR2_INSEL1_Pos)

