bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_bt.h
#define	BTx_PRES_PRESCALE_Pos	0	/* 输入Group1的预分频寄存器 (Group1 input signal prescaler)
分频数=（X+1），即00表示1分频，FF表示256分频。预分频后的信号都为单周期脉冲的形式，占空比1:X */
#define	BTx_PRES_PRESCALE_Msk	(0xffU << BTx_PRES_PRESCALE_Pos)

#define	BTx_LOADCR_LHEN_Pos	4	/* 高位加载控制 (Counter highend load enable)
写1将预置数寄存器ET1PRESETH和加载寄存器ET1LOADH分别加载到计数值寄存器ET1CNTH和比较寄存器ET1CMPH，写0无效，该位硬件自动清0。在16位的定时/计数下LHEN作为计数器的加载控制，LLEN自动失效 */
#define	BTx_LOADCR_LHEN_Msk	(0x1U << BTx_LOADCR_LHEN_Pos)

#define	BTx_LOADCR_LLEN_Pos	0	/* 低位加载控制 (Counter lowend load enable)
写1将预置数寄存器PRESETL和加载寄存器LOADL分别加载到计数值寄存器ET1CNTL和比较寄存器ET1CMPL，写0无效，该位硬件自动清0。在16位的定时/计数下LHEN作为计数器的加载控制，LLEN自动失效 */
#define	BTx_LOADCR_LLEN_Msk	(0x1U << BTx_LOADCR_LLEN_Pos)

#define	BTx_CNTL_CNTL_Pos	0	/* 计数器低位计数值寄存器 (counter lowend)
LLEN有效时加载预置数到该寄存器。 */
#define	BTx_CNTL_CNTL_Msk	(0xffU << BTx_CNTL_CNTL_Pos)

#define	BTx_CNTH_CNTH_Pos	0	/* 计数器高位计数值寄存器 (counter highend)
LHEN有效时加载预置数到该寄存器。 */
#define	BTx_CNTH_CNTH_Msk	(0xffU << BTx_CNTH_CNTH_Pos)

#define	BTx_PRESET_PRESETH_Pos	8	/* 计数器高位预置数寄存器 (preset highend)
用于保存高位计数器初值，或保存捕捉结果高8bit */
#define	BTx_PRESET_PRESETH_Msk	(0xffU << BTx_PRESET_PRESETH_Pos)

#define	BTx_PRESET_PRESETL_Pos	0	/* 计数器低位预置数寄存器 (preset lowend)
用于保存低位计数器初值，或保存捕捉结果低8bit */
#define	BTx_PRESET_PRESETL_Msk	(0xffU << BTx_PRESET_PRESETL_Pos)

#define	BTx_LOADL_LOADL_Pos	0	/* 计数器低位加载寄存器 (load lowend counter)
在计数匹配或执行加载命令时将加载寄存器的值加载至比较工作寄存器。 */
#define	BTx_LOADL_LOADL_Msk	(0xffU << BTx_LOADL_LOADL_Pos)

#define	BTx_LOADH_LOADH_Pos	0	/* 计数器高位加载寄存器 (load highend counter)
在计数匹配或执行加载命令时将加载寄存器的值加载至比较工作寄存器。当工作在8位定时/计数器模式时，该高位加载寄存器不支持加载值为0x00的设置。 */
#define	BTx_LOADH_LOADH_Msk	(0xffU << BTx_LOADH_LOADH_Pos)

#define	BTx_CMPL_CMPL_Pos	0	/* 计数器低位比较寄存器 (compare lowend )
加载寄存器的值加载后将写入该寄存器，该寄存器与计数器比较，若计数值大于等于该寄存器的值，则产生计数匹配信号至输出控制模块，并产生相应中断。 */
#define	BTx_CMPL_CMPL_Msk	(0xffU << BTx_CMPL_CMPL_Pos)

#define	BTx_CMPH_CMPH_Pos	0	/* 计数器高位比较寄存器 (compare highend)
加载寄存器的值加载后将写入该寄存器，该寄存器与计数器比较，若计数值大于等于该寄存器的值，则产生计数匹配信号至输出控制模块，并产生相应中断。 */
#define	BTx_CMPH_CMPH_Msk	(0xffU << BTx_CMPH_CMPH_Pos)

#define	BTx_OUTCNT_OUTCNT_Pos	0	/* 计数器输出脉冲宽度计数器 (output pulse width counter)
该寄存器用于调整输出脉冲宽度。计数时钟为32768Hz，对应的输出脉冲宽度范围为30.5uS~125mS。输出脉冲宽度=(OUTCNT+1)/32768秒 */
#define	BTx_OUTCNT_OUTCNT_Msk	(0xfffU << BTx_OUTCNT_OUTCNT_Pos)

#define	BTx_OCR_OUTCLR_Pos	5
#define	BTx_OCR_OUTCLR_Msk	(0x1U << BTx_OCR_OUTCLR_Pos)
#define	BTx_OCR_OUTCLR_INVALID	(0x0U << BTx_OCR_OUTCLR_Pos)
#define	BTx_OCR_OUTCLR_CLEAR	(0x1U << BTx_OCR_OUTCLR_Pos)

#define	BTx_OCR_OUTINV_Pos	4
#define	BTx_OCR_OUTINV_Msk	(0x1U << BTx_OCR_OUTINV_Pos)
#define	BTx_OCR_OUTINV_NORMAL	(0x0U << BTx_OCR_OUTINV_Pos)
#define	BTx_OCR_OUTINV_REVERSE	(0x1U << BTx_OCR_OUTINV_Pos)

#define	BTx_OCR_OUTMOD_Pos	3
#define	BTx_OCR_OUTMOD_Msk	(0x1U << BTx_OCR_OUTMOD_Pos)
#define	BTx_OCR_OUTMOD_PULSE_SHIFT	(0x0U << BTx_OCR_OUTMOD_Pos)
#define	BTx_OCR_OUTMOD_NEG	(0x1U << BTx_OCR_OUTMOD_Pos)

#define	BTx_OCR_OUTSEL_Pos	0
#define	BTx_OCR_OUTSEL_Msk	(0x7U << BTx_OCR_OUTSEL_Pos)
#define	BTx_OCR_OUTSEL_HIGH	(0x0U << BTx_OCR_OUTSEL_Pos)
#define	BTx_OCR_OUTSEL_LOW	(0x1U << BTx_OCR_OUTSEL_Pos)
#define	BTx_OCR_OUTSEL_GROUP1	(0x2U << BTx_OCR_OUTSEL_Pos)
#define	BTx_OCR_OUTSEL_GROUP2	(0x3U << BTx_OCR_OUTSEL_Pos)
#define	BTx_OCR_OUTSEL_PWM	(0x4U << BTx_OCR_OUTSEL_Pos)

#define	BTx_IER_CMPHIE_Pos	4	/* 扩展定时器高位比较发生信号 (compare highend interrupt enable)
1 = 中断使能
0 = 中断禁止 */
#define	BTx_IER_CMPHIE_Msk	(0x1U << BTx_IER_CMPHIE_Pos)

#define	BTx_IER_CMPLIE_Pos	3	/* 扩展定时器低位比较发生信号 (compare lowend interrupt enable)
1 = 中断使能
0 = 中断禁止 */
#define	BTx_IER_CMPLIE_Msk	(0x1U << BTx_IER_CMPLIE_Pos)

#define	BTx_IER_OVHIE_Pos	2	/* 定时器高位溢出信号 (highend overflow interrupt enable)
1 = 中断使能
0 = 中断禁止 */
#define	BTx_IER_OVHIE_Msk	(0x1U << BTx_IER_OVHIE_Pos)

#define	BTx_IER_OVLIE_Pos	1	/* 定时器低位溢出信号 (lowend overflow interrupt enable)
1 = 中断使能
0 = 中断禁止 */
#define	BTx_IER_OVLIE_Msk	(0x1U << BTx_IER_OVLIE_Pos)

#define	BTx_IER_CAPIE_Pos	0	/* 定时器捕捉产生信号 (capture interrupt enable)
1 = 中断使能
0 = 中断禁止 */
#define	BTx_IER_CAPIE_Msk	(0x1U << BTx_IER_CAPIE_Pos)

#define	BTx_ISR_EDGESTA_Pos	5	/* 捕捉沿状态
1 = 捕捉到下沿
0 = 捕捉到上沿 */
#define	BTx_ISR_EDGESTA_Msk	(0x1U << BTx_ISR_EDGESTA_Pos)

#define	BTx_ISR_CMPHIF_Pos	4	/* 定时器高位比较发生信号 (compare highend interrupt flag)
1 = 当前计数器的值大于等于比较寄存器的值，该信号将重新加载新的加载寄存器的值到工作寄存器。
0 = 当前计数器的值小于比较寄存器的值 */
#define	BTx_ISR_CMPHIF_Msk	(0x1U << BTx_ISR_CMPHIF_Pos)

#define	BTx_ISR_CMPLIF_Pos	3	/* 定时器低位比较发生信号 (compare lowend interrupt flag)
1 = 当前计数器的值大于等于比较寄存器的值，该信号将重新加载新的加载寄存器的值到工作寄存器。
0 = 当前计数器的值小于比较寄存器的值 */
#define	BTx_ISR_CMPLIF_Msk	(0x1U << BTx_ISR_CMPLIF_Pos)

#define	BTx_ISR_OVHIF_Pos	2	/* 定时器高位溢出信号 (highend overflow interrupt flag)
1 = 产生计数溢出
0 = 未产生溢出 */
#define	BTx_ISR_OVHIF_Msk	(0x1U << BTx_ISR_OVHIF_Pos)

#define	BTx_ISR_OVLIF_Pos	1	/* 定时器低位溢出信号 (lowend overflow interrupt flag)
1 = 产生计数溢出
0 = 未产生溢出 */
#define	BTx_ISR_OVLIF_Msk	(0x1U << BTx_ISR_OVLIF_Pos)

#define	BTx_ISR_CAPIF_Pos	0	/* 定时器捕捉产生信号 (capture interrupt flag)
1 = 捕捉到指定的沿
0 = 未捕捉到指定的沿 */
#define	BTx_ISR_CAPIF_Msk	(0x1U << BTx_ISR_CAPIF_Pos)
//Macro_End

/* Exported functions --------------------------------------------------------*/ 
extern void BTx_Deinit(BT_Type* BTx);

/* 高8位计数器（BT1H或BT2H）启动控制  相关函数 */
extern void BTx_CR1_CHEN_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR1_CHEN_Getable(BT_Type* BTx);

/* 低8位计数器（BT1L或BT2L）启动控制
(Counter-Lowend enable)
1：启动低8bit计数器，在计数器模式下启动时将预置数值和加载值分别加载至计数器和比较寄存器；捕捉模式下启动时计数器由零开始自由计数，计数到0xFFFF后产生溢出信号然后由零开始重新计数，捕捉功能只工作在16位模式；在16位的定时/计数和捕捉模式下CHEN作为计数器的启动控制，CLEN自动失效
0：停止低8bit计数器计数 相关函数 */
extern void BTx_CR1_CLEN_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR1_CLEN_Getable(BT_Type* BTx);

/* 工作模式选择 (work mode)
1：16位捕捉模式
0：8位定时/计数模式，若高位计数器计数源选择为低位计数器的溢出信号，则可实现16位定时/计数模式 相关函数 */
extern void BTx_CR1_MODE_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR1_MODE_Get(BT_Type* BTx);

/* 计数模式下的计数沿和周期捕捉时的捕捉沿选择位 (edge select)
1：计数模式采样计数源下降沿，周期捕捉模式时下沿捕捉
0：计数模式采样计数源上升沿，周期捕捉模式时上沿捕捉
注：不支持系统时钟的下降沿计数，捕捉源和计数源为系统时钟时选择下降沿将不会有效计数。 相关函数 */
extern void BTx_CR1_EDGESEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR1_EDGESEL_Get(BT_Type* BTx);

/* 捕捉模式控制（只在捕捉模式下有效）(capture mode)
1：脉冲宽度捕捉
0：脉冲周期捕捉 相关函数 */
extern void BTx_CR1_CAPMOD_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR1_CAPMOD_Get(BT_Type* BTx);

/* 带清零捕捉模式控制 (capture clear)
1：不论在脉冲宽度还是周期捕捉情况下，捕捉到第一个沿后将计数器清零产生中断，捕捉到第二个沿后锁存（锁存到高低位预置数寄存器）计数值并同时清零计数器
0：捕捉不清零，计数器一直自由计数 相关函数 */
extern void BTx_CR1_CAPCLR_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR1_CAPCLR_Getable(BT_Type* BTx);

