bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_bt.h
/* 单次捕捉控制 (capture once)
1：单次捕捉有效，在捕捉到一次脉冲宽度或脉冲周期后计数器停止，若需要再次捕捉需重新启动
0：连续捕捉 相关函数 */
extern void BTx_CR1_CAPONCE_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR1_CAPONCE_Get(BT_Type* BTx);

/* PWM模式输出 (pulse width modulation)
1：PWM输出使能
0：PWM 输出不使能 相关函数 */
extern void BTx_CR1_PWM_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR1_PWM_Getable(BT_Type* BTx);

/* 计数器内部计数源信号选择 (signal group2 select)
1：内部计数源信号选择Group2
0：内部计数源信号选择Group1 相关函数 */
extern void BTx_CR2_SIG2SEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR2_SIG2SEL_Get(BT_Type* BTx);

/* 计数器内部捕捉源信号选择 (signal group1 select)
1：内部捕捉源信号选择Group1
0：内部捕捉源信号选择Group2 相关函数 */
extern void BTx_CR2_SIG1SEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR2_SIG1SEL_Get(BT_Type* BTx);

/* 高8位计数器计数源选择 (Counter Highend source select)
00/11：选择ET1的低位计数器的溢出信号，与低位计数器组成16位计数器
01：选择内部捕捉源信号
10：选择内部计数源信号或外部DIR输入组合信号 相关函数 */
extern void BTx_CR2_CNTHSEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR2_CNTHSEL_Get(BT_Type* BTx);

/* 外部输入DIR控制使能。通常电量脉冲输出时同时会输出一个由高低电平指示正反向的方向信号DIR。电路将通过DIR信号电平的高低，分别控制高位计数器和低位计数器计数使能，以实现针对正向、反向脉冲的各种计数功能 (direction bit enable)
1：外部输入的DIR信号有效，此时高低位计数器是否计数可由外部输入的DIR信号控制。
0：外部输入的DIR信号无效，此时高低位计数器是否计数将由内部控制信号控制。 相关函数 */
extern void BTx_CR2_DIREN_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR2_DIREN_Getable(BT_Type* BTx);

/* 内部DIR控制信号，当DIREN为0，即外部输入DIR控制无效时，可由该信号代替DIR输入，直接控制内部计数器的计数。当需要外部DIR输入，即DIREN为1时，该位应设置为0 (set direction)
1：内部DIR信号为高电平，则高8位计数器计数 相关函数 */
extern void BTx_CR2_STDIR_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR2_STDIR_Getable(BT_Type* BTx);

/* 低位计数器计数使能控制选择信号 (source select)
1低位计数器计数使能端选则常使能。此时低位计数器计数不受DIR控制，可将正反向所有脉冲一并计数
0：低位计数器计数使能端选则由寄存器STDIR或外部EX_SIG2输入控制。 相关函数 */
extern void BTx_CR2_SRCSEL_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_CR2_SRCSEL_Getable(BT_Type* BTx);

/* 输入信号2极性选择 (direction polarity)
1：对外部输入DIR信号EX_SIG2反向
0：对外部输入DIR信号EX_SIG2不反向 相关函数 */
extern void BTx_CR2_DIRPO_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CR2_DIRPO_Get(BT_Type* BTx);

/* RTCOUT2信号选择控制2 (RTCOUT2 source select)
00 = 32768Hz，XTLF时钟输出
01 = RTCSec，由RTC模块输出的秒信号
10 = RTCMin，由RTC模块输出的分钟信号
11 = RFU 相关函数 */
extern void BTx_CFGR1_RTCSEL2_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR1_RTCSEL2_Get(BT_Type* BTx);

/* RTCOUT1信号选择控制1 (RTCOUT1 source select)
00 = 32768Hz，XTLF时钟输出
01 = RTCSec，由RTC模块输出的秒信号
10 = RTCMin，由RTC模块输出的分钟信号
11 = RFU 相关函数 */
extern void BTx_CFGR1_RTCSEL1_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR1_RTCSEL1_Get(BT_Type* BTx);

/* Group2信号选择控制 (Group2 source select)
00 = APBCLK
01 = RTCOUT2
10 = IN_SIG2，内部输入信号2
11 = EX_SIG2，外部输入信号2
注：不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 相关函数 */
extern void BTx_CFGR1_GRP2SEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR1_GRP2SEL_Get(BT_Type* BTx);

/* Group1信号选择控制（可作为捕捉模式下采样时钟选择，同时可作为信号捕捉源）(Group1 source select)
00 = APBCLK
01 = RTCOUT1
10 = IN_SIG1，内部输入信号1
11 = EX_SIG1，外部输入信号1
注：不支持APBCLK的下降沿捕捉和计数，捕捉源和计数源为APBCLK时选择下降沿将不会有效捕捉和计数。 相关函数 */
extern void BTx_CFGR1_GRP1SEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR1_GRP1SEL_Get(BT_Type* BTx);

/* 外部输入信号选择控制2 (external source select2)
00 = BT1_IN0/BT2_IN0
01 = BT1_IN1/BT2_IN1
10 = BT1_IN2/BT2_IN2
11 = BT1_IN3/BT2_IN3 相关函数 */
extern void BTx_CFGR2_EXSEL2_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR2_EXSEL2_Get(BT_Type* BTx);

/* 外部输入信号选择控制1 (external source select1)
00 = BT1_IN0/BT2_IN0
01 = BT1_IN1/BT2_IN1
10 = BT1_IN2/BT2_IN2
11 = BT1_IN3/BT2_IN3 相关函数 */
extern void BTx_CFGR2_EXSEL1_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR2_EXSEL1_Get(BT_Type* BTx);

/* 内部输入信号选择控制2 (internal source select 2)
00 = UART_RX3/UART_RX3
01 = UART_RX4/UART_RX4
10 = UART_RX5/UART_RX5
11 = RCLP/BT1_OUT 相关函数 */
extern void BTx_CFGR2_INSEL2_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR2_INSEL2_Get(BT_Type* BTx);

/* 内部输入信号选择控制1 (internal source select 1)
00 = UART_RX0/UART_RX0
01 = UART_RX1/UART_RX1
10 = UART_RX2/UART_RX2
11 = RCLP/RCLP 相关函数 */
extern void BTx_CFGR2_INSEL1_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CFGR2_INSEL1_Get(BT_Type* BTx);

/* 输入Group1的预分频寄存器 (Group1 input signal prescaler)
分频数=（X+1），即00表示1分频，FF表示256分频。预分频后的信号都为单周期脉冲的形式，占空比1:X 相关函数 */
extern void BTx_PRES_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_PRES_Read(BT_Type* BTx);

/* 高位加载控制 (Counter highend load enable)
写1将预置数寄存器ET1PRESETH和加载寄存器ET1LOADH分别加载到计数值寄存器ET1CNTH和比较寄存器ET1CMPH，写0无效，该位硬件自动清0。在16位的定时/计数下LHEN作为计数器的加载控制，LLEN自动失效 相关函数 */
extern void BTx_LOADCR_LHEN_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_LOADCR_LHEN_Getable(BT_Type* BTx);

/* 低位加载控制 (Counter lowend load enable)
写1将预置数寄存器PRESETL和加载寄存器LOADL分别加载到计数值寄存器ET1CNTL和比较寄存器ET1CMPL，写0无效，该位硬件自动清0。在16位的定时/计数下LHEN作为计数器的加载控制，LLEN自动失效 相关函数 */
extern void BTx_LOADCR_LLEN_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_LOADCR_LLEN_Getable(BT_Type* BTx);

/* 计数器低位计数值寄存器 (counter lowend)
LLEN有效时加载预置数到该寄存器。 相关函数 */
extern uint32_t BTx_CNTL_Read(BT_Type* BTx);

/* 计数器高位计数值寄存器 (counter highend)
LHEN有效时加载预置数到该寄存器。 相关函数 */
extern uint32_t BTx_CNTH_Read(BT_Type* BTx);

/* 计数器高位预置数寄存器 (preset highend)
用于保存高位计数器初值，或保存捕捉结果高8bit 相关函数 */
extern void BTx_PRESET_PRESETH_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_PRESET_PRESETH_Get(BT_Type* BTx);

/* 计数器低位预置数寄存器 (preset lowend)
用于保存低位计数器初值，或保存捕捉结果低8bit 相关函数 */
extern void BTx_PRESET_PRESETL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_PRESET_PRESETL_Get(BT_Type* BTx);

/* 计数器低位加载寄存器 (load lowend counter)
在计数匹配或执行加载命令时将加载寄存器的值加载至比较工作寄存器。 相关函数 */
extern void BTx_LOADL_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_LOADL_Read(BT_Type* BTx);

/* 计数器高位加载寄存器 (load highend counter)
在计数匹配或执行加载命令时将加载寄存器的值加载至比较工作寄存器。当工作在8位定时/计数器模式时，该高位加载寄存器不支持加载值为0x00的设置。 相关函数 */
extern void BTx_LOADH_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_LOADH_Read(BT_Type* BTx);

/* 计数器低位比较寄存器 (compare lowend )
加载寄存器的值加载后将写入该寄存器，该寄存器与计数器比较，若计数值大于等于该寄存器的值，则产生计数匹配信号至输出控制模块，并产生相应中断。 相关函数 */
extern void BTx_CMPL_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CMPL_Read(BT_Type* BTx);

