bajihahaha/-/RTthread_Blink_DeepSleep - 副本 (2)/Drivers/fm33a0xxev_bt.h
/* 计数器高位比较寄存器 (compare highend)
加载寄存器的值加载后将写入该寄存器，该寄存器与计数器比较，若计数值大于等于该寄存器的值，则产生计数匹配信号至输出控制模块，并产生相应中断。 相关函数 */
extern void BTx_CMPH_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_CMPH_Read(BT_Type* BTx);

/* 计数器输出脉冲宽度计数器 (output pulse width counter)
该寄存器用于调整输出脉冲宽度。计数时钟为32768Hz，对应的输出脉冲宽度范围为30.5uS~125mS。输出脉冲宽度=(OUTCNT+1)/32768秒 相关函数 */
extern void BTx_OUTCNT_Write(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_OUTCNT_Read(BT_Type* BTx);
extern void BTx_OCR_OUTCLR_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_OCR_OUTCLR_Get(BT_Type* BTx);
extern void BTx_OCR_OUTINV_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_OCR_OUTINV_Get(BT_Type* BTx);
extern void BTx_OCR_OUTMOD_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_OCR_OUTMOD_Get(BT_Type* BTx);
extern void BTx_OCR_OUTSEL_Set(BT_Type* BTx, uint32_t SetValue);
extern uint32_t BTx_OCR_OUTSEL_Get(BT_Type* BTx);

/* 扩展定时器高位比较发生信号 (compare highend interrupt enable)
1 = 中断使能
0 = 中断禁止 相关函数 */
extern void BTx_IER_CMPHIE_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_IER_CMPHIE_Getable(BT_Type* BTx);

/* 扩展定时器低位比较发生信号 (compare lowend interrupt enable)
1 = 中断使能
0 = 中断禁止 相关函数 */
extern void BTx_IER_CMPLIE_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_IER_CMPLIE_Getable(BT_Type* BTx);

/* 定时器高位溢出信号 (highend overflow interrupt enable)
1 = 中断使能
0 = 中断禁止 相关函数 */
extern void BTx_IER_OVHIE_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_IER_OVHIE_Getable(BT_Type* BTx);

/* 定时器低位溢出信号 (lowend overflow interrupt enable)
1 = 中断使能
0 = 中断禁止 相关函数 */
extern void BTx_IER_OVLIE_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_IER_OVLIE_Getable(BT_Type* BTx);

/* 定时器捕捉产生信号 (capture interrupt enable)
1 = 中断使能
0 = 中断禁止 相关函数 */
extern void BTx_IER_CAPIE_Setable(BT_Type* BTx, FunState NewState);
extern FunState BTx_IER_CAPIE_Getable(BT_Type* BTx);

/* 捕捉沿状态
1 = 捕捉到下沿
0 = 捕捉到上沿 */
extern FlagStatus BTx_ISR_EDGESTA_Chk(BT_Type* BTx);

/* 定时器高位比较发生信号 (compare highend interrupt flag)
1 = 当前计数器的值大于等于比较寄存器的值，该信号将重新加载新的加载寄存器的值到工作寄存器。
0 = 当前计数器的值小于比较寄存器的值 相关函数 */
extern void BTx_ISR_CMPHIF_Clr(BT_Type* BTx);
extern FlagStatus BTx_ISR_CMPHIF_Chk(BT_Type* BTx);

/* 定时器低位比较发生信号 (compare lowend interrupt flag)
1 = 当前计数器的值大于等于比较寄存器的值，该信号将重新加载新的加载寄存器的值到工作寄存器。
0 = 当前计数器的值小于比较寄存器的值 相关函数 */
extern void BTx_ISR_CMPLIF_Clr(BT_Type* BTx);
extern FlagStatus BTx_ISR_CMPLIF_Chk(BT_Type* BTx);

/* 定时器高位溢出信号 (highend overflow interrupt flag)
1 = 产生计数溢出
0 = 未产生溢出 相关函数 */
extern void BTx_ISR_OVHIF_Clr(BT_Type* BTx);
extern FlagStatus BTx_ISR_OVHIF_Chk(BT_Type* BTx);

/* 定时器低位溢出信号 (lowend overflow interrupt flag)
1 = 产生计数溢出
0 = 未产生溢出 相关函数 */
extern void BTx_ISR_OVLIF_Clr(BT_Type* BTx);
extern FlagStatus BTx_ISR_OVLIF_Chk(BT_Type* BTx);

/* 定时器捕捉产生信号 (capture interrupt flag)
1 = 捕捉到指定的沿
0 = 未捕捉到指定的沿 相关函数 */
extern void BTx_ISR_CAPIF_Clr(BT_Type* BTx);
extern FlagStatus BTx_ISR_CAPIF_Chk(BT_Type* BTx);
//Announce_End

#ifdef __cplusplus
}
#endif

#endif /*__FM33A0XXEV_BT_H */
